{
    "common": {
	"missingData": "Please enter missing data.",
	"required": "Input required",
	"search": "Search",
	"submit": "Submit",
	"clear": "Clear",
	"update": "Update",
	"delete": "Delete"
    },
    "index": {
      "headline1": "MMDA: An interactive toolkit for Corpus-based Discourse Analysis",
	"paragraph1": "Corpus-based discourse analysis (CDA) is a popular and highly successful technique for the investigation of socio-political research questions. The CDA procedure starts from collocation analyses for selected topic queries. Collocates are then grouped into semantically meaningful categories, e.g. attitudes and opinions. Interpretations of semantic categories are verified and refined by careful inspection of the corresponding KWIC concordances. Given the widespread use of CDA and recent advances in computational linguistic techniques, it is surprising that researchers still have to rely on general-purpose corpus tools such as CQPweb.",
	"paragraph2": "The interactive software toolkit you are using here, called MMDA (for mixed-methods discourse analysis) is a dedicated software solution that combines the necessary steps of CDA into a single consistent and efficient working environment. It enables you to carry out multiple collocation analyses in parallel, and visualizes the results in an intuitive way. You can try out different parameter settings in real time, which provides a more comprehensive understanding of the semantic space of the discourse. Semantic groups can be created and modified interactively.",
	"paragraph3": "From a Digital Humanities perspective, our approach can be understood as an attempt to blend close and distant reading techniques. Moreover, our visualizations are more sensible than standard word clouds: they are two-dimensional approximations of the semantics captured by high-dimensional word embeddings, which we created for the respective linguistic registers. Easily accessible and exportable concordance lines accompany all visualizations to ensure close reading. All in all, the MMDA toolkit represents a first step towards a more sophisticated CDA methodology, in which the manual categorization procedure is operationalized in terms of so-called discoursemes – groups of related collocates that form building blocks of discursive positions.",
	"headlinePublications": "Publications",
	"headlineAcknowledgements": "Acknowledgements",
	"Acknowledgements": "This work is supported by the Emerging Fields Initiative (EFI) of Friedrich-Alexander-Universität Erlangen-Nürnberg (project title: Exploring the 'Fukushima Effect' (EFE))."
    },
    "about": {
	"headline2": "The Workflow",
 	"paragraph2_1": "Initially, the researcher carries chooses one or more lexical items (called “topic nodes”) as a starting point for a collocation analysis. From this, a two-dimensional visualization is created, which represents the semantically structured map of the discourse.",
	"paragraph2_2": "In this interactive map, the researcher can groups of related collocates into discoursemes.",
	"headline3": "What is a discourseme?",
	"paragraph3_1": "A discourseme is a user-created list of related collocates. On its surface, it represents a simple list of lexical items, which the researched decided belong together. The list of topic nodes form a special discourseme – the topic discourseme. ",
	"paragraph3_2": "Combining several discoursemes with one another uncover discursive positions.",
	"headline4": "What is a discursive position?",
	"paragraph4_1": "A discursive position represents an attitude towards a topic."
    },
    "login": {
	"username": "Username",
	"password": "Password",
	"missing_input": "Please enter username and password.",
	"bad_request": "Incorrect username or password (password length has to be >= 8).",
	"unauthorized": "Incorrect username or password.",
	"network": "Network Error."
    },
    "toolbar": {
	"about": "Manual",
	"login": "Login",
	"logout": "Logout"
    },
    "sidebar": {
	"profile": "Profile",
	"analysis": "Analysis",
	"discourseme": "Discourseme",
	"position": "Discursive Position",
	"administration": "Administration",
	"users": "Users",
	"objects": "Objects"
    },
    "profile": {
	"firstName": "First Name",
	"lastName": "Last Name",
	"email": "Email",
	"updateProfile": "Update Profile",
	"updatePassword": "Update Password",
	"password": "New Password",
	"passwordRepeat": "Repeat new Password",
	"messages": {
	    "passwordMatch": "Passwords do not match.",
	    "passwordChanged": "Password changed.",
	    "updateProfile": "Profile Updated."
	}
    },
    "analysis": {
	"newAnalysis": "New Analysis",
	"name": "Name",
	"corpus": "Corpus",
	"associatedDiscoursemes": "Associated Discoursemes",
	"availableDiscoursemes": "Available Discoursemes",
	"coordinates": "Coordinates",
	"openWordcloud": "Open Wordcloud",
	"updateName": "Update Name",
	"reloadCoordinates": "Reload Coordinates",
	"delete": "Delete",
	"new": {
	    "name": "Analysis Name",
	    "corpus": "Corpus",
	    "items": "Topic Items",
	    "windowSize": "Window Size",
	    "helpTitle": "What is an Analysis?",
	    "helpText": "This is the starting point for the mixed-methods discourse analysis. Select one or more lexical items as a starting point for a collocation analysis within a choosen corpus. From this a two-dimensional visualization is created, which represents the semantically structured map of the discourse",
	    "helpName": "User-defined name for the new analysis",
	    "helpCorpus": "The corpus for the initial collocation analysis",
	    "helpItems": "Topics items are a set of lexemes, which form the node of a collocation analysis. Lexemes can include multi-word units (MWU).",
	    "helpWindowSize": "Maximum window size for the initial collocation analysis.",
	    "helpPQuery": "p-attribute to use for the collocation analysis (e.g. word, lemma, etc).",
	    "helpSBreak": "s-attribute to use for breaking the collocation windows (e.g. s, p, tweet, etc).",
	    "missing_data": "Please enter missing data",
	    "invalid_input": "Entered data is not valid",
	    "no_collocates": "No collocates of the given topic-items were found in the given corpus.",
	    "no_topic": "None of the Topic-items have been found in the given corpus."
	},
    "concordances":{
	"not_found":"No such analysis or no concordances available.",
	"invalid_input":"Concordance parameters invalid."
    },
	"collocates":{
	    "not_found": "No such analysis or no collocates available.",
	    "invalid_input": "Collocation parameters invalid."
	},
	"coordinates_request":{
	    "not_found": "Analysis not available."
	}
    },
    "discourseme": {
	"newDiscourseme": "New Discourseme",
	"name": "Name",
	"items": "Lexical Items",
	"new": {
	    "name": "Discourseme Name",
	    "items": "Lexical Items",
	    "helpTitle": "What is a Discourseme?",
	    "helpText": "A discourseme is a user-created list of releated collocates. On its surface, a simple list of lexical items, which the researched decided belong together. They are used to form discursive positions.",
	    "helpName": "User-defined name for the new discourseme",
	    "helpItems": "Items are a set of lexemes, which form the discourseme. Lexemes can include multi-word units (MWU) and can be adjusted at a later time."
	}
    },
    "position": {
	"newPosition": "New Discursive Position",
	"name": "Name",
	"associatedDiscoursemes": "Associated Discoursemes",
	"availableDiscoursemes": "Available Discoursemes",
	"new": {
	    "name": "Discursive Position Name",
	    "discoursemes": "Discoursemes",
	    "helpTitle": "What is a Discursive Position?",
	    "helpText": "A discursive position represents an attitudes towards a topic. On the surface, a user-created list of previously created discoursemes.",
	    "helpName": "User-defined name for the new discursive position",
	    "helpDiscoursemes": "A selection of available discoursemes that are included in the discursive position. Can be adjusted at a later time."
	},
	"extraction": {
	    "helpTitle": "Discursive Position Concordance Extraction",
	    "helpText": "The concordances extraction is based on the previously associated discoursemes, a selection of corpora and a set of topic items (from an analysis).",
	    "corpora": "Corpora",
	    "helpCorpora": "Selection of corpora to extract (random) concordances from.",
	    "analysis": "Analysis",
	    "helpAnalysis": "The topic discourseme items of this analysis will be used for the concordance extraction."
	}
    },
    "admin": {
	"addUser": "Add User",
	"newUser": {
	    "username": "User Name",
	    "firstName": "First Name",
	    "lastName": "Last Name",
	    "email": "Email",
	    "password": "New Password",
	    "passwordRepeat": "Repeat new Password",
	    "isAdmin": "New User is Administrator",
	    "addUser": "Add User"
	}
    },
    "wordcloud": {
	"sidebar": {
	    "metadata": "Metadata",
	    "windowSize": "Window Size"
    }
  }
}
